Uni-Libraries/Uni.HAL/src/tim/uni_hal_tim_stm32l4.c
//
// Includes
//

// stdlib
#include <stddef.h>
#include <stdint.h>
#include <string.h>

// FreeRTOS
#include <FreeRTOS.h>

// ST
#include <stm32l4xx_ll_tim.h>

// Uni.Common
#include <uni_common.h>

// Uni.HAL
#include "core/uni_hal_core.h"
#include "core/uni_hal_core_enum.h"
#include "rcc/uni_hal_rcc.h"
#include "systick/uni_hal_systick.h"
#include "tim/uni_hal_tim.h"

//
// Defines
//

#define UNI_HAL_TIM_MAXTIMERS (17U)

//
// Globals
//

static uni_hal_tim_context_t *g_uni_hal_tim_ctx[UNI_HAL_TIM_MAXTIMERS] = {NULL};

static uni_hal_tim_callback_fn _callback_fn[UNI_HAL_TIM_MAXTIMERS] = {0};

static void *_callback_userctx[UNI_HAL_TIM_MAXTIMERS] = {NULL};


//
// Private/LL
//

static uint32_t _uni_hal_tim_ll_capture_get(TIM_TypeDef *handle, uni_hal_tim_channel_num_e chan){
    uint32_t result = UINT32_MAX;

    switch(chan){
        case UNI_HAL_TIM_CHANNEL_1:
            result = LL_TIM_IC_GetCaptureCH1(handle);
            break;
        case UNI_HAL_TIM_CHANNEL_2:
            result = LL_TIM_IC_GetCaptureCH2(handle);
            break;
        case UNI_HAL_TIM_CHANNEL_3:
            result = LL_TIM_IC_GetCaptureCH3(handle);
            break;
        case UNI_HAL_TIM_CHANNEL_4:
            result = LL_TIM_IC_GetCaptureCH4(handle);
            break;
        default:
            break;
    }

    return result;
}


static void _uni_hal_tim_ll_overcapture_clear(TIM_TypeDef *handle, uni_hal_tim_channel_num_e chan){
    switch(chan){
        case UNI_HAL_TIM_CHANNEL_1:
            LL_TIM_ClearFlag_CC1OVR(handle);
            break;
        case UNI_HAL_TIM_CHANNEL_2:
            LL_TIM_ClearFlag_CC2OVR(handle);
            break;
        case UNI_HAL_TIM_CHANNEL_3:
            LL_TIM_ClearFlag_CC3OVR(handle);
            break;
        case UNI_HAL_TIM_CHANNEL_4:
            LL_TIM_ClearFlag_CC4OVR(handle);
            break;
        default:
            break;
    }
}


static void _uni_hal_tim_ll_capture_clear(TIM_TypeDef *handle, uni_hal_tim_channel_num_e chan){
    switch(chan){
        case UNI_HAL_TIM_CHANNEL_1:
            LL_TIM_ClearFlag_CC1(handle);
            break;
        case UNI_HAL_TIM_CHANNEL_2:
            LL_TIM_ClearFlag_CC2(handle);
            break;
        case UNI_HAL_TIM_CHANNEL_3:
            LL_TIM_ClearFlag_CC3(handle);
            break;
        case UNI_HAL_TIM_CHANNEL_4:
            LL_TIM_ClearFlag_CC4(handle);
            break;
        default:
            break;
    }
}

static void _uni_hal_tim_ll_capture_it_set(TIM_TypeDef *handle, uni_hal_tim_channel_num_e chan, bool val){
    switch(chan){
        case UNI_HAL_TIM_CHANNEL_1:
            val ? LL_TIM_EnableIT_CC1(handle) : LL_TIM_DisableIT_CC1(handle);
            break;
        case UNI_HAL_TIM_CHANNEL_2:
            val ? LL_TIM_EnableIT_CC2(handle) : LL_TIM_DisableIT_CC2(handle);
            break;
        case UNI_HAL_TIM_CHANNEL_3:
            val ? LL_TIM_EnableIT_CC3(handle) : LL_TIM_DisableIT_CC3(handle);
            break;
        case UNI_HAL_TIM_CHANNEL_4:
            val ? LL_TIM_EnableIT_CC4(handle) : LL_TIM_DisableIT_CC4(handle);
            break;
        default:
            break;
    }
}


static bool _uni_hal_tim_ll_overcapture_get(TIM_TypeDef *handle, uni_hal_tim_channel_num_e chan){
    bool result = false;

    switch(chan){
        case UNI_HAL_TIM_CHANNEL_1:
            result = LL_TIM_IsActiveFlag_CC1OVR(handle);
            break;
        case UNI_HAL_TIM_CHANNEL_2:
            result = LL_TIM_IsActiveFlag_CC2OVR(handle);
            break;
        case UNI_HAL_TIM_CHANNEL_3:
            result = LL_TIM_IsActiveFlag_CC3OVR(handle);
            break;
        case UNI_HAL_TIM_CHANNEL_4:
            result = LL_TIM_IsActiveFlag_CC4OVR(handle);
            break;
        default:
            break;
    }

    return result;
}



//
// Private
//

static uint32_t _uni_hal_tim_get_number(uni_hal_core_periph_e instance) {
    uint32_t result = 0U;
    switch (instance) {
    case UNI_HAL_CORE_PERIPH_TIM_1:
        result = 1U;
        break;
    case UNI_HAL_CORE_PERIPH_TIM_2:
        result = 2U;
        break;
    case UNI_HAL_CORE_PERIPH_TIM_3:
        result = 3U;
        break;
    case UNI_HAL_CORE_PERIPH_TIM_4:
        result = 4U;
        break;
    case UNI_HAL_CORE_PERIPH_TIM_5:
        result = 5U;
        break;
    case UNI_HAL_CORE_PERIPH_TIM_6:
        result = 6U;
        break;
    case UNI_HAL_CORE_PERIPH_TIM_7:
        result = 7U;
        break;
    case UNI_HAL_CORE_PERIPH_TIM_8:
        result = 8U;
        break;
    case UNI_HAL_CORE_PERIPH_TIM_15:
        result = 15U;
        break;
    case UNI_HAL_CORE_PERIPH_TIM_16:
        result = 16U;
        break;
    case UNI_HAL_CORE_PERIPH_TIM_17:
        result = 17U;
        break;
    default:
        break;
    }

    return result;
}

static uint32_t _uni_hal_tim_get_number_by_handle(TIM_TypeDef *instance) {
    uint32_t result = 0U;
    if (instance == TIM1) {
        result = 1U;
    }
    else if (instance == TIM2) {
        result = 2U;
    }
    else if (instance == TIM3) {
        result = 3U;
    }
    else if (instance == TIM4) {
        result = 4U;
    }
    else if (instance == TIM5) {
        result = 5U;
    }
    else if (instance == TIM6) {
        result = 6U;
    }
    else if (instance == TIM7) {
        result = 7U;
    }
    else if (instance == TIM8) {
        result = 8U;
    }
    else if (instance == TIM15) {
        result = 15U;
    }
    else if (instance == TIM16) {
        result = 16U;
    }
    else if (instance == TIM17) {
        result = 17U;
    }
    else {
        result = 0U;
    }

    return result;
}

static TIM_TypeDef *_uni_hal_tim_get_handle(uni_hal_core_periph_e instance) {
    TIM_TypeDef *result = NULL;
    switch (instance) {
    case UNI_HAL_CORE_PERIPH_TIM_1:
        result = TIM1;
        break;
    case UNI_HAL_CORE_PERIPH_TIM_2:
        result = TIM2;
        break;
    case UNI_HAL_CORE_PERIPH_TIM_3:
        result = TIM3;
        break;
    case UNI_HAL_CORE_PERIPH_TIM_4:
        result = TIM4;
        break;
    case UNI_HAL_CORE_PERIPH_TIM_5:
        result = TIM5;
        break;
    case UNI_HAL_CORE_PERIPH_TIM_6:
        result = TIM6;
        break;
    case UNI_HAL_CORE_PERIPH_TIM_7:
        result = TIM7;
        break;
    case UNI_HAL_CORE_PERIPH_TIM_8:
        result = TIM8;
        break;
    case UNI_HAL_CORE_PERIPH_TIM_15:
        result = TIM15;
        break;
    case UNI_HAL_CORE_PERIPH_TIM_16:
        result = TIM16;
        break;
    case UNI_HAL_CORE_PERIPH_TIM_17:
        result = TIM17;
        break;
    default:
        break;
    }

    return result;
}

static uint32_t _uni_hal_tim_get_channel(uni_hal_tim_channel_num_e channel)
{
    uint32_t result = 0U;
    switch (channel)
    {
    case UNI_HAL_TIM_CHANNEL_1:
        result = LL_TIM_CHANNEL_CH1;
        break;
    case UNI_HAL_TIM_CHANNEL_2:
        result = LL_TIM_CHANNEL_CH2;
        break;
    case UNI_HAL_TIM_CHANNEL_3:
        result = LL_TIM_CHANNEL_CH3;
        break;
    case UNI_HAL_TIM_CHANNEL_4:
        result = LL_TIM_CHANNEL_CH4;
        break;
    case UNI_HAL_TIM_CHANNEL_5:
        result = LL_TIM_CHANNEL_CH5;
        break;
    case UNI_HAL_TIM_CHANNEL_6:
        result = LL_TIM_CHANNEL_CH6;
        break;
    default:
        break;
    }
    return result;
}

