Uni-Libraries/Uni.HAL/src/tim/uni_hal_tim_stm32l4.c
static uint32_t _uni_hal_tim_get_polarity(uni_hal_tim_polarity_e channel)
{
    uint32_t result = 0U;
    switch (channel)
    {
    case UNI_HAL_TIM_POLARITY_RISING:
        result = LL_TIM_IC_POLARITY_RISING;
        break;
    case UNI_HAL_TIM_POLARITY_FALLING:
        result = LL_TIM_IC_POLARITY_FALLING;
        break;
    case UNI_HAL_TIM_POLARITY_BOTH:
        result = LL_TIM_IC_POLARITY_BOTHEDGE;
        break;
    default:
        break;
    }
    return result;
}




typedef struct
{
    uint32_t counter;
    uint32_t overflow_count;
} _uni_hal_tim_capture_t;


static uint32_t _uni_hal_tim_get_counter_period(TIM_TypeDef *handle)
{
    uint32_t result = 0U;
    if (handle != NULL)
    {
        uint32_t reload = LL_TIM_GetAutoReload(handle);
        if (reload < UINT32_MAX)
        {
            result = reload + 1U;
        }
    }

    return result;
}


static _uni_hal_tim_capture_t _uni_hal_tim_get_capture(TIM_TypeDef *handle, uni_hal_tim_context_t* ctx, uint32_t counter)
{
    _uni_hal_tim_capture_t result = {
        .counter = counter,
        .overflow_count = ctx->status.overflow_count,
    };

    uint32_t period = _uni_hal_tim_get_counter_period(handle);

    if (period > 0U)
    {
        uint32_t half_period = period / 2U;
        uint32_t current_counter = LL_TIM_GetCounter(handle);

        // TIM1 update and capture IRQs must use the same preempt priority: this
        // helper relies on UIF/overflow_count staying stable while CC IRQ runs.
        if (LL_TIM_IsActiveFlag_UPDATE(handle))
        {
            if (counter < half_period)
            {
                result.overflow_count++;
            }
        }
        else if (result.overflow_count > 0U && current_counter < half_period && counter > half_period)
        {
            result.overflow_count--;
        }
    }

    return result;
}


static bool _uni_hal_tim_get_capture_delta(TIM_TypeDef *handle, const _uni_hal_tim_capture_t* current, const uni_hal_tim_channel_state_t* previous, uint32_t* delta)
{
    bool result = false;

    if (handle != NULL && current != NULL && previous != NULL && delta != NULL)
    {
        uint64_t delta64 = 0U;
        uint32_t period = _uni_hal_tim_get_counter_period(handle);
        uint32_t overflow_delta = current->overflow_count - previous->overflow_count;

        if (period == 0U)
        {
            delta64 = (uint32_t)(current->counter - previous->counter);
        }
        else if (current->counter >= previous->counter)
        {
            delta64 = ((uint64_t)overflow_delta * period) + (current->counter - previous->counter);
        }
        else if (overflow_delta > 0U)
        {
            delta64 = ((uint64_t)(overflow_delta - 1U) * period) + (period - previous->counter) + current->counter;
        }

        if (delta64 > 0U && delta64 <= UINT32_MAX)
        {
            *delta = (uint32_t)delta64;
            result = true;
        }
    }

    return result;
}


static bool _uni_hal_tim_init_channel(uni_hal_tim_context_t* ctx, uni_hal_tim_channel_t* channel)
{
    bool result = false;
    if (ctx != NULL && channel != NULL)
    {
        result = true;
        if (channel->gpio)
        {
            result = uni_hal_gpio_pin_init(channel->gpio);
        }

        if (channel->type == UNI_HAL_TIM_TYPE_INPUTCAPTURE)
        {
            LL_TIM_IC_InitTypeDef ic_config = {
                .ICPolarity = _uni_hal_tim_get_polarity(channel->polarity),
                .ICActiveInput = LL_TIM_ACTIVEINPUT_DIRECTTI,
                .ICPrescaler = LL_TIM_ICPSC_DIV1,
                .ICFilter = (channel->filter & 0xFU) << 20U,
            };
            result = result && (LL_TIM_IC_Init(_uni_hal_tim_get_handle(ctx->config.instance), _uni_hal_tim_get_channel(channel->channel_number), &ic_config) == SUCCESS);
        }
        else if (channel->type == UNI_HAL_TIM_TYPE_OUTPUTCOMPARE)
        {
            LL_TIM_OC_InitTypeDef oc_config = {
                .OCMode = LL_TIM_OCMODE_TOGGLE,
                .OCState = LL_TIM_OCSTATE_DISABLE,
                .OCNState = LL_TIM_OCSTATE_DISABLE,
                .CompareValue = 0,
                .OCPolarity = LL_TIM_OCPOLARITY_HIGH,
                .OCNPolarity = LL_TIM_OCPOLARITY_HIGH,
                .OCIdleState = LL_TIM_OCIDLESTATE_LOW,
                .OCNIdleState = LL_TIM_OCIDLESTATE_LOW
            };
            result = result && (LL_TIM_OC_Init(_uni_hal_tim_get_handle(ctx->config.instance), _uni_hal_tim_get_channel(channel->channel_number), &oc_config) == SUCCESS);
        }
        else
        {
            result = false;
        }
    }

    return result;
}

static bool _uni_hal_tim_prescaler_valid(uint32_t value){
    return value <= UINT16_MAX;
}


static bool _uni_hal_tim_reloadvalue_valid(uni_hal_core_periph_e periph, uint32_t value){
    bool result = false;

    switch(periph){
        case UNI_HAL_CORE_PERIPH_TIM_1:
        case UNI_HAL_CORE_PERIPH_TIM_3:
        case UNI_HAL_CORE_PERIPH_TIM_4:
        case UNI_HAL_CORE_PERIPH_TIM_6:
        case UNI_HAL_CORE_PERIPH_TIM_7:
        case UNI_HAL_CORE_PERIPH_TIM_8:
        case UNI_HAL_CORE_PERIPH_TIM_15:
        case UNI_HAL_CORE_PERIPH_TIM_16:
        case UNI_HAL_CORE_PERIPH_TIM_17:
            result = value <= UINT16_MAX;
            break;
        case UNI_HAL_CORE_PERIPH_TIM_2:
        case UNI_HAL_CORE_PERIPH_TIM_5:
            result = true;
            break;
        default:
            break;
    }

    return result;
}



//
// Handlers/CC
//

static void _uni_hal_tim_irq_cc_chan(uni_hal_tim_context_t* ctx, TIM_TypeDef* handle, uni_hal_tim_channel_num_e chan)
{
    uni_hal_tim_channel_state_t* chan_st = &ctx->status.chan[chan];

    if(_uni_hal_tim_ll_overcapture_get(handle, chan)){
        chan_st->seen = false;
        chan_st->valid = false;
        _uni_hal_tim_ll_overcapture_clear(handle, chan);
        _uni_hal_tim_ll_capture_clear(handle, chan);
    }
    else{
        uint32_t value = _uni_hal_tim_ll_capture_get(handle, chan);
        _uni_hal_tim_capture_t capture = _uni_hal_tim_get_capture(handle, ctx, value);

        if(chan_st->seen){
            uint32_t delta = 0U;
            bool delta_valid = _uni_hal_tim_get_capture_delta(handle, &capture, chan_st, &delta);
            chan_st->counter = capture.counter;
            chan_st->overflow_count = capture.overflow_count;

            if (delta_valid) {
                chan_st->period = delta;
                chan_st->timestamp = uni_hal_systick_get_ms();
                chan_st->valid = true;
            }
            else {
                chan_st->valid = false;
            }
        }
        else{
            chan_st->counter = capture.counter;
            chan_st->overflow_count = capture.overflow_count;
            chan_st->seen = true;
        }
    }
}

static void _uni_hal_tim_irq_cc(TIM_TypeDef* handle)
{
    uint32_t tim_number = _uni_hal_tim_get_number_by_handle(handle);
    if (tim_number > 0U && tim_number <= UNI_HAL_TIM_MAXTIMERS) {
        uni_hal_tim_context_t* ctx = g_uni_hal_tim_ctx[tim_number - 1U];
        if (ctx != NULL) {
            if (LL_TIM_IsActiveFlag_CC1(handle)) {
                _uni_hal_tim_irq_cc_chan(ctx, handle, UNI_HAL_TIM_CHANNEL_1);
            }

            if (LL_TIM_IsActiveFlag_CC2(handle)) {
                _uni_hal_tim_irq_cc_chan(ctx, handle, UNI_HAL_TIM_CHANNEL_2);
            }

            if (LL_TIM_IsActiveFlag_CC3(handle)) {
                _uni_hal_tim_irq_cc_chan(ctx, handle, UNI_HAL_TIM_CHANNEL_3);
            }

            if (LL_TIM_IsActiveFlag_CC4(handle)) {
                _uni_hal_tim_irq_cc_chan(ctx, handle, UNI_HAL_TIM_CHANNEL_4);
            }

            // CC5 / CC6 cannot be used here
        }
    }
}



//
// Handlers/Update
//

