Uni-Libraries/Uni.HAL/src/tim/uni_hal_tim_stm32l4.c
static void _uni_hal_tim_irq_update(TIM_TypeDef* handle){
    uint32_t tim_number = _uni_hal_tim_get_number_by_handle(handle);
    if (tim_number > 0U && tim_number <= UNI_HAL_TIM_MAXTIMERS) {
        uni_hal_tim_context_t* ctx = g_uni_hal_tim_ctx[tim_number - 1U];
        if (ctx != NULL) {
            ctx->status.overflow_count++;
        }
    }
}


static bool _uni_hal_tim_irq_update_callback(TIM_TypeDef* handle, uni_hal_core_periph_e periph)
{
    bool result = false;

    if (LL_TIM_IsActiveFlag_UPDATE(handle))
    {
        if (LL_TIM_IsEnabledIT_UPDATE(handle))
        {
            result = uni_hal_tim_period_elapsed(periph);
        }
        else
        {
            LL_TIM_ClearFlag_UPDATE(handle);
        }
    }

    return result;
}


static bool _uni_hal_tim_update_callback_registered(uni_hal_tim_context_t* ctx)
{
    bool result = false;

    if (ctx != NULL)
    {
        uint32_t id = _uni_hal_tim_get_number(ctx->config.instance);
        result = id > 0U && id <= UNI_HAL_TIM_MAXTIMERS && _callback_fn[id - 1U] != NULL;
    }

    return result;
}


static bool _uni_hal_tim_enable_update_irq(uni_hal_tim_context_t* ctx, TIM_TypeDef* handle)
{
    bool result = false;

    if (ctx != NULL && handle != NULL)
    {
        switch (ctx->config.instance)
        {
        case UNI_HAL_CORE_PERIPH_TIM_1:
        case UNI_HAL_CORE_PERIPH_TIM_16:
            result = uni_hal_core_irq_enable(UNI_HAL_CORE_IRQ_TIM_1_UP, 5, 0);
            break;
        case UNI_HAL_CORE_PERIPH_TIM_15:
            result = uni_hal_core_irq_enable(UNI_HAL_CORE_IRQ_TIM_15, 5, 0);
            break;
        case UNI_HAL_CORE_PERIPH_TIM_17:
            result = uni_hal_core_irq_enable(UNI_HAL_CORE_IRQ_TIM_17, 5, 0);
            break;
        default:
            break;
        }

        if (result)
        {
            LL_TIM_EnableIT_UPDATE(handle);
        }
    }

    return result;
}



//
// Handlers
//

void TIM1_CC_IRQHandler(void) {
    _uni_hal_tim_irq_cc(TIM1);
}


void TIM1_BRK_TIM15_IRQHandler(void) {
    portYIELD_FROM_ISR(_uni_hal_tim_irq_update_callback(TIM15, UNI_HAL_CORE_PERIPH_TIM_15));
}


void TIM1_UP_TIM16_IRQHandler(void) {
    bool higher_priority_woken = false;

    if (LL_TIM_IsActiveFlag_UPDATE(TIM1)) {
        if (LL_TIM_IsEnabledIT_UPDATE(TIM1)) {
            _uni_hal_tim_irq_update(TIM1);
            higher_priority_woken |= uni_hal_tim_period_elapsed(UNI_HAL_CORE_PERIPH_TIM_1);
        }
        else {
            LL_TIM_ClearFlag_UPDATE(TIM1);
        }
    }

    higher_priority_woken |= _uni_hal_tim_irq_update_callback(TIM16, UNI_HAL_CORE_PERIPH_TIM_16);
    portYIELD_FROM_ISR(higher_priority_woken);
}


void TIM1_TRG_COM_TIM17_IRQHandler(void) {
    portYIELD_FROM_ISR(_uni_hal_tim_irq_update_callback(TIM17, UNI_HAL_CORE_PERIPH_TIM_17));
}

void TIM2_IRQHandler(void) {

}

UNI_COMMON_COMPILER_WEAK void TIM7_IRQHandler(void) {
    (void)uni_hal_tim_period_elapsed(UNI_HAL_CORE_PERIPH_TIM_7);
}



//
// Functions
//

bool uni_hal_tim_init(uni_hal_tim_context_t *ctx) {
    bool result = false;
    if (ctx != NULL){
        ctx->status.inited = false;
        if(_uni_hal_tim_prescaler_valid(ctx->config.prescaler)
            && _uni_hal_tim_reloadvalue_valid(ctx->config.instance, ctx->config.reload_value))
        {
            TIM_TypeDef *handle = _uni_hal_tim_get_handle(ctx->config.instance);
            if (handle != NULL)
            {
                result = uni_hal_rcc_clk_set(ctx->config.instance, true);

                LL_TIM_InitTypeDef tim_init;
                tim_init.Prescaler = ctx->config.prescaler;
                tim_init.CounterMode = LL_TIM_COUNTERMODE_UP;
                tim_init.Autoreload = ctx->config.reload_value;
                tim_init.ClockDivision = LL_TIM_CLOCKDIVISION_DIV1;
                tim_init.RepetitionCounter = 0x00;
                result = result && (LL_TIM_Init(handle, &tim_init) == SUCCESS);

                if (ctx->config.channel_count > 0 && ctx->config.channel != NULL)
                {
                    for (size_t i = 0; i < ctx->config.channel_count; i++)
                    {
                        result = result && _uni_hal_tim_init_channel(ctx, ctx->config.channel[i]);
                    }
                }

                uint32_t id = _uni_hal_tim_get_number(ctx->config.instance);
                if ((id > 0U) && (id <= UNI_HAL_TIM_MAXTIMERS))
                {
                    if (result)
                    {
                        g_uni_hal_tim_ctx[id - 1U] = ctx;
                    }
                    else if (g_uni_hal_tim_ctx[id - 1U] == ctx)
                    {
                        g_uni_hal_tim_ctx[id - 1U] = nullptr;
                    }
                }
                else
                {
                    result = false;
                }
                ctx->status.inited = result;
            }
        }
    }
    return result;
}

bool uni_hal_tim_register_callback(uni_hal_tim_context_t *ctx, uni_hal_tim_callback_fn callback, void *callback_ctx) {
    bool result = false;

    if (uni_hal_tim_is_inited(ctx)) {
        uint32_t id = _uni_hal_tim_get_number(ctx->config.instance);
        if (id > 0U) {
            if (g_uni_hal_tim_ctx[id-1] == ctx)
            {
                _callback_fn[id - 1] = callback;
                _callback_userctx[id - 1] = callback_ctx;
                result = true;
            }
        }
    }

    return result;
}


bool uni_hal_tim_start(uni_hal_tim_context_t *ctx) {
    bool result = false;

    if (uni_hal_tim_is_inited(ctx)) {
        TIM_TypeDef *handle = _uni_hal_tim_get_handle(ctx->config.instance);
        if (handle != NULL) {
            ctx->status.overflow_count = 0U;
            memset(ctx->status.chan, 0, sizeof(ctx->status.chan));
            LL_TIM_ClearFlag_UPDATE(handle);

            bool has_inputcapture = false;
            bool has_update_callback = _uni_hal_tim_update_callback_registered(ctx);
            if (ctx->config.channel != NULL)
            {
                for (size_t i = 0; i < ctx->config.channel_count; i++)
                {
                    if (ctx->config.channel[i] != NULL && ctx->config.channel[i]->type == UNI_HAL_TIM_TYPE_INPUTCAPTURE)
                    {
                        has_inputcapture = true;
                        uni_hal_tim_channel_num_e chan_num = ctx->config.channel[i]->channel_number;

