Uni-Libraries/Uni.HAL/src/tim/uni_hal_tim_stm32l4.c
                        _uni_hal_tim_ll_capture_clear(handle, chan_num);
                        _uni_hal_tim_ll_overcapture_clear(handle, chan_num);
                        _uni_hal_tim_ll_capture_it_set(handle, chan_num, true);

                        LL_TIM_CC_EnableChannel(handle,  _uni_hal_tim_get_channel(chan_num));
                    }
                }
            }

            if (ctx->config.instance == UNI_HAL_CORE_PERIPH_TIM_1)
            {
                uni_hal_core_irq_enable(UNI_HAL_CORE_IRQ_TIM_1, 5, 0);
                if (has_inputcapture || has_update_callback)
                {
                    result = _uni_hal_tim_enable_update_irq(ctx, handle);
                }
                else
                {
                    result = true;
                }
            }
            else if (has_update_callback)
            {
                result = _uni_hal_tim_enable_update_irq(ctx, handle);
            }
            else
            {
                result = true;
            }

            if (result)
            {
                LL_TIM_EnableCounter(handle);
            }
        }
    }

    return result;
}


bool uni_hal_tim_clear(uni_hal_tim_context_t* ctx)
{
    bool result = false;

    if (uni_hal_tim_is_inited(ctx)) {
        TIM_TypeDef *handle = _uni_hal_tim_get_handle(ctx->config.instance);
        if (handle != NULL) {
            uint32_t primask = uni_hal_core_irq_pause();

            LL_TIM_SetCounter(handle, 0U);
            LL_TIM_ClearFlag_UPDATE(handle);
            ctx->status.overflow_count = 0U;

            memset(ctx->status.chan, 0, sizeof(ctx->status.chan));

            if (ctx->config.channel != NULL)
            {
                for (size_t i = 0; i < ctx->config.channel_count; i++)
                {
                    if (ctx->config.channel[i] != NULL && ctx->config.channel[i]->type == UNI_HAL_TIM_TYPE_INPUTCAPTURE)
                    {
                        uni_hal_tim_channel_num_e chan_num = ctx->config.channel[i]->channel_number;
                        _uni_hal_tim_ll_capture_clear(handle, chan_num);
                        _uni_hal_tim_ll_overcapture_clear(handle, chan_num);
                    }
                }
            }

            uni_hal_core_irq_resume(primask);
            result = true;
        }
    }

    return result;
}


bool uni_hal_tim_stop(uni_hal_tim_context_t *ctx) {
    bool result = false;

    if (uni_hal_tim_is_inited(ctx)) {
        TIM_TypeDef *handle = _uni_hal_tim_get_handle(ctx->config.instance);
        if (handle != NULL) {
            LL_TIM_DisableCounter(handle);
            LL_TIM_SetCounter(handle, 0U);

            if (ctx->config.channel != NULL)
            {
                for (size_t i = 0; i < ctx->config.channel_count; i++)
                {
                    if (ctx->config.channel[i] != NULL && ctx->config.channel[i]->type == UNI_HAL_TIM_TYPE_INPUTCAPTURE)
                    {
                        uni_hal_tim_channel_num_e chan_num = ctx->config.channel[i]->channel_number;

                        LL_TIM_CC_DisableChannel(handle, _uni_hal_tim_get_channel(chan_num));
                        _uni_hal_tim_ll_capture_it_set(handle, chan_num, false);
                        _uni_hal_tim_ll_capture_clear(handle, chan_num);
                        _uni_hal_tim_ll_overcapture_clear(handle, chan_num);
                    }
                }
            }

            LL_TIM_DisableIT_UPDATE(handle);
            LL_TIM_ClearFlag_UPDATE(handle);
            ctx->status.overflow_count = 0U;

            memset(ctx->status.chan, 0, sizeof(ctx->status.chan));

            if (ctx->config.instance == UNI_HAL_CORE_PERIPH_TIM_1)
            {
                uni_hal_core_irq_disable(UNI_HAL_CORE_IRQ_TIM_1);
            }

            result = true;
        }
    }

    return result;
}

bool uni_hal_tim_period_elapsed(uni_hal_core_periph_e periph) {
    bool result = false;
    TIM_TypeDef *handle = _uni_hal_tim_get_handle(periph);

    if (handle != NULL) {
        if (LL_TIM_IsActiveFlag_UPDATE(handle)) {
            LL_TIM_ClearFlag_UPDATE(handle);
            uint32_t id = _uni_hal_tim_get_number_by_handle(handle);
            if ((id > 0U) && (id <= UNI_HAL_TIM_MAXTIMERS)) {
                uni_hal_tim_callback_fn fn = _callback_fn[id - 1];
                if (fn != NULL) {
                    result = fn(g_uni_hal_tim_ctx[id - 1], _callback_userctx[id - 1]);
                }
            }
        }
    }

    return result;
}

bool uni_hal_tim_is_channel_valid(uni_hal_tim_context_t *ctx, uni_hal_tim_channel_num_e channel)
{
    bool result = false;
    if(ctx != NULL){
        result = ((uint32_t)channel < UNI_HAL_TIM_CHANNEL_MAXCOUNT) && ctx->status.chan[channel].valid;
    }
    return result;
}


//
// get_tick_period
//

uint32_t uni_hal_tim_get_tick_period_ns(uni_hal_tim_context_t *ctx) {
    uint32_t result = 0U;

    if (uni_hal_tim_is_inited(ctx) && _uni_hal_tim_prescaler_valid(ctx->config.prescaler))
    {
        result = uni_hal_rcc_clk_get_freq(ctx->config.instance);
        result = result / (ctx->config.prescaler + 1);
        if (result)
        {
            result = 1000000000UL / result;
        }
        else
        {
            result = 0;
        }
    }

    return result;
}

uint32_t uni_hal_tim_get_tick_period_us(uni_hal_tim_context_t *ctx) {
    return uni_hal_tim_get_tick_period_ns(ctx) / 1'000;
}


bool uni_hal_tim_get_chan_state(uni_hal_tim_context_t *ctx, uni_hal_tim_channel_num_e channel, uni_hal_tim_channel_state_t *out){
    bool result = false;

    if (uni_hal_tim_is_inited(ctx) && out != NULL)
    {
        uint32_t primask = uni_hal_core_irq_pause();
        if(uni_hal_tim_is_channel_valid(ctx, channel)){
            memcpy(out, &ctx->status.chan[channel], sizeof(uni_hal_tim_channel_state_t));
            result = true;
        }
        uni_hal_core_irq_resume(primask);
    }

    return result;
}


//
// get_chan_period
//

uint64_t uni_hal_tim_get_chan_period_ns(uni_hal_tim_context_t *ctx, uni_hal_tim_channel_state_t* chan_state) {
    uint64_t result = UINT64_MAX;

    if (uni_hal_tim_is_inited(ctx) && chan_state != NULL && chan_state->valid)
    {
        result = chan_state->period * (uint64_t)uni_hal_tim_get_tick_period_ns(ctx);
    }

    return result;
}

