Uni-Libraries/Uni.HAL/src/tim/uni_hal_tim_stm32l4.c
uint64_t uni_hal_tim_get_chan_period_us(uni_hal_tim_context_t *ctx, uni_hal_tim_channel_state_t* chan_state) {
    uint64_t result = UINT64_MAX;

    uint64_t period_ns = uni_hal_tim_get_chan_period_ns(ctx, chan_state);
    if(period_ns < UINT64_MAX){
        result = period_ns / 1'000;
    }

    return result;
}


//
// get_chan_freq
//

uint64_t uni_hal_tim_get_chan_freq_mhz(uni_hal_tim_context_t *ctx, uni_hal_tim_channel_state_t* chan_state) {
    uint64_t result = UINT64_MAX;

    uint64_t period_ns = uni_hal_tim_get_chan_period_ns(ctx, chan_state);
    if (period_ns != 0U && period_ns != UINT64_MAX)
    {
        result = (1'000'000'000'000 + (period_ns / 2U)) / period_ns;
    }

    return result;
}

uint64_t uni_hal_tim_get_chan_freq_hz(uni_hal_tim_context_t* ctx, uni_hal_tim_channel_state_t* chan_state)
{
    uint64_t result = UINT64_MAX;

    uint64_t freq_mhz = uni_hal_tim_get_chan_freq_mhz(ctx, chan_state);
    if(freq_mhz != UINT64_MAX){
        result = (freq_mhz + 500U) / 1'000;
    }

    return result;
}

uint32_t uni_hal_tim_get_chan_age(uni_hal_tim_context_t* ctx, uni_hal_tim_channel_state_t* chan_state)
{
    uint32_t result = UINT32_MAX;
    if (uni_hal_tim_is_inited(ctx) && chan_state != NULL &&  chan_state->valid)
    {
        result = uni_hal_systick_get_ms() - chan_state->timestamp;
    }
    return result;
}

bool uni_hal_tim_set_arrpreload(uni_hal_tim_context_t* ctx, bool val)
{
    bool result = false;

    if (uni_hal_tim_is_inited(ctx))
    {
        TIM_TypeDef *handle = _uni_hal_tim_get_handle(ctx->config.instance);
        if (handle != NULL)
        {
            val ? LL_TIM_EnableARRPreload(handle) : LL_TIM_DisableARRPreload(handle);
        }
        result = true;
    }

    return result;
}

bool uni_hal_tim_set_dmarequest(uni_hal_tim_context_t * ctx, bool val)
{
    bool result = false;

    if (uni_hal_tim_is_inited(ctx))
    {
        TIM_TypeDef *handle = _uni_hal_tim_get_handle(ctx->config.instance);
        if (handle != NULL)
        {
            val ? LL_TIM_EnableDMAReq_UPDATE(handle) : LL_TIM_DisableDMAReq_UPDATE(handle);
        }
        result = true;
    }

    return result;
}
